---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Distance
source: html/a282c08c-fd16-99e0-096e-18db901573a9.htm
---
# Autodesk.Revit.DB.SpecTypeId.Distance Property

Distance, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId Distance { get; }
```